OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/include/pic16/pic18f86j55.h
#define _USART1OD               0x01
#define _U1OD                   0x01
#define _USART2OD               0x02
#define _U2OD                   0x02

//==============================================================================

extern __at(0x0FCE) __sfr TMR1;
extern __at(0x0FCE) __sfr TMR1L;

//==============================================================================
//        ODCON1 Bits

extern __at(0x0FCF) __sfr ODCON1;

typedef struct
  {
  unsigned ECCP1OD              : 1;
  unsigned ECCP2OD              : 1;
  unsigned ECCP3OD              : 1;
  unsigned CCP4OD               : 1;
  unsigned CCP5OD               : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  unsigned                      : 1;
  } __ODCON1bits_t;

extern __at(0x0FCF) volatile __ODCON1bits_t ODCON1bits;

#define _ECCP1OD                0x01
#define _ECCP2OD                0x02
#define _ECCP3OD                0x04
#define _CCP4OD                 0x08
#define _CCP5OD                 0x10

//==============================================================================

extern __at(0x0FCF) __sfr TMR1H;

//==============================================================================
//        RCON Bits

extern __at(0x0FD0) __sfr RCON;

typedef union
  {
  struct
    {
    unsigned NOT_BOR            : 1;
    unsigned NOT_POR            : 1;
    unsigned NOT_PD             : 1;
    unsigned NOT_TO             : 1;
    unsigned NOT_RI             : 1;
    unsigned NOT_CM             : 1;
    unsigned                    : 1;
    unsigned IPEN               : 1;
    };

  struct
    {
    unsigned BOR                : 1;
    unsigned POR                : 1;
    unsigned PD                 : 1;
    unsigned TO                 : 1;
    unsigned RI                 : 1;
    unsigned CM                 : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };
  } __RCONbits_t;

extern __at(0x0FD0) volatile __RCONbits_t RCONbits;

#define _NOT_BOR                0x01
#define _BOR                    0x01
#define _NOT_POR                0x02
#define _POR                    0x02
#define _NOT_PD                 0x04
#define _PD                     0x04
#define _NOT_TO                 0x08
#define _TO                     0x08
#define _NOT_RI                 0x10
#define _RI                     0x10
#define _NOT_CM                 0x20
#define _CM                     0x20
#define _IPEN                   0x80

//==============================================================================


//==============================================================================
//        CM2CON Bits

extern __at(0x0FD1) __sfr CM2CON;

typedef union
  {
  struct
    {
    unsigned C1CH0              : 1;
    unsigned C1CH1              : 1;
    unsigned CREF               : 1;
    unsigned EVPOL0             : 1;
    unsigned EVPOL1             : 1;
    unsigned CPOL               : 1;
    unsigned COE                : 1;
    unsigned CON                : 1;
    };

  struct
    {
    unsigned CCH0               : 1;
    unsigned CCH1               : 1;
    unsigned CREF2              : 1;
    unsigned EVPOL02            : 1;
    unsigned EVPOL12            : 1;
    unsigned CPOL2              : 1;
    unsigned COE2               : 1;
    unsigned CON2               : 1;
    };

  struct
    {
    unsigned C1CH02             : 1;
    unsigned C1CH12             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCH                : 2;
    unsigned                    : 6;
    };
  } __CM2CONbits_t;

extern __at(0x0FD1) volatile __CM2CONbits_t CM2CONbits;

#define _CM2CON_C1CH0           0x01
#define _CM2CON_CCH0            0x01
#define _CM2CON_C1CH02          0x01
#define _CM2CON_C1CH1           0x02
#define _CM2CON_CCH1            0x02
#define _CM2CON_C1CH12          0x02
#define _CM2CON_CREF            0x04
#define _CM2CON_CREF2           0x04
#define _CM2CON_EVPOL0          0x08
#define _CM2CON_EVPOL02         0x08
#define _CM2CON_EVPOL1          0x10
#define _CM2CON_EVPOL12         0x10
#define _CM2CON_CPOL            0x20
#define _CM2CON_CPOL2           0x20
#define _CM2CON_COE             0x40
#define _CM2CON_COE2            0x40
#define _CM2CON_CON             0x80
#define _CM2CON_CON2            0x80

//==============================================================================


//==============================================================================
//        CM2CON1 Bits

extern __at(0x0FD1) __sfr CM2CON1;

typedef union
  {
  struct
    {
    unsigned C1CH0              : 1;
    unsigned C1CH1              : 1;
    unsigned CREF               : 1;
    unsigned EVPOL0             : 1;
    unsigned EVPOL1             : 1;
    unsigned CPOL               : 1;
    unsigned COE                : 1;
    unsigned CON                : 1;
    };

  struct
    {
    unsigned CCH0               : 1;
    unsigned CCH1               : 1;
    unsigned CREF2              : 1;
    unsigned EVPOL02            : 1;
    unsigned EVPOL12            : 1;
    unsigned CPOL2              : 1;
    unsigned COE2               : 1;
    unsigned CON2               : 1;
    };

  struct
    {
    unsigned C1CH02             : 1;
    unsigned C1CH12             : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned CCH                : 2;
    unsigned                    : 6;
    };
  } __CM2CON1bits_t;

extern __at(0x0FD1) volatile __CM2CON1bits_t CM2CON1bits;

#define _CM2CON1_C1CH0          0x01
#define _CM2CON1_CCH0           0x01
#define _CM2CON1_C1CH02         0x01
#define _CM2CON1_C1CH1          0x02
#define _CM2CON1_CCH1           0x02
#define _CM2CON1_C1CH12         0x02
#define _CM2CON1_CREF           0x04
#define _CM2CON1_CREF2          0x04
#define _CM2CON1_EVPOL0         0x08
#define _CM2CON1_EVPOL02        0x08
#define _CM2CON1_EVPOL1         0x10
#define _CM2CON1_EVPOL12        0x10
#define _CM2CON1_CPOL           0x20
#define _CM2CON1_CPOL2          0x20
#define _CM2CON1_COE            0x40
#define _CM2CON1_COE2           0x40
#define _CM2CON1_CON            0x80
#define _CM2CON1_CON2           0x80

//==============================================================================


//==============================================================================
//        CM1CON Bits

extern __at(0x0FD2) __sfr CM1CON;

typedef union
  {
  struct
    {
    unsigned C1CH0              : 1;
    unsigned C1CH1              : 1;
    unsigned CREF               : 1;
    unsigned EVPOL0             : 1;
    unsigned EVPOL1             : 1;
    unsigned CPOL               : 1;
    unsigned COE                : 1;
    unsigned CON                : 1;
    };

  struct
    {
    unsigned CCH0               : 1;
    unsigned CCH1               : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    unsigned                    : 1;
    };

  struct
    {
    unsigned C1CH               : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned CCH                : 2;
    unsigned                    : 6;
    };

  struct
    {
    unsigned                    : 3;
    unsigned EVPOL              : 2;
    unsigned                    : 3;
    };
  } __CM1CONbits_t;

extern __at(0x0FD2) volatile __CM1CONbits_t CM1CONbits;

#define _C1CH0                  0x01
#define _CCH0                   0x01
#define _C1CH1                  0x02
#define _CCH1                   0x02
#define _CREF                   0x04
#define _EVPOL0                 0x08
#define _EVPOL1                 0x10
#define _CPOL                   0x20
#define _COE                    0x40
#define _CON                    0x80

//==============================================================================


//==============================================================================
//        CM1CON1 Bits

